import asyncio
from scanner.async_scan import scan_target
from report.report_generator import generate_report
from assets.loader import show_loader

def banner():
    print(r"""
    ██████╗  █████╗ ██████╗ ██╗  ██╗███████╗ ██████╗ ██╗     ██╗
    ██╔══██╗██╔══██╗██╔══██╗██║ ██╔╝██╔════╝██╔═══██╗██║     ██║
    ██║  ██║███████║██████╔╝█████╔╝ █████╗  ██║   ██║██║     ██║
    ██║  ██║██╔══██║██╔══██╗██╔═██╗ ██╔══╝  ██║   ██║██║     ██║
    ██████╔╝██║  ██║██║  ██║██║  ██╗███████╗╚██████╔╝███████╗██║
    ╚═════╝ ╚═╝  ╚═╝╚═╝  ╚═╝╚═╝  ╚═╝╚══════╝ ╚═════╝ ╚══════╝╚═╝

        DarkSqli Pro CLI Scanner
    """)

async def main():
    banner()
    show_loader()

    target = input("\n[?] Enter Target URL (e.g. http://example.com?id=1): ")

    print("[*] Scanning started...\n")

    results = await scan_target(target)

    generate_report(target, results)

    print("\n[✔] Scan Complete! Report saved as report.html")

if __name__ == "__main__":
    asyncio.run(main())
